CHT/flow-over-plate/buoyantPimpleFoam-laplacianFoam_extended_fine_solid/Fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          41;
        startFace       27742;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          41;
        startFace       27783;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          343;
        startFace       27824;
    }
    slip-bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          81;
        startFace       28167;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          101;
        startFace       28248;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          161;
        startFace       28349;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28126;
        startFace       28510;
    }
)

// ************************************************************************* //
